dict_min = {
    0: ('ровно', ''),
    1: ('одна', 'одной'), 2: ('две', 'двух'), 3: ('три', 'трех'),
    4: ('четыре', 'четырех'), 5: ('пять', 'пяти'), 6: ('шесть', 'шести'),
    7: ('семь', 'семи'), 8: ('восемь', 'восьми'), 9: ('девять', 'девяти'),
    10: ('десять', 'десяти'), 11: ('одиннадцать', 'одиннадцати'),
    12: ('двенадцать', 'двенадцати'), 13: ('тринадцать', 'тринадцати'),
    14: ('четырнадцать', 'четырнадцати'), 15: ('пятнадцать', 'пятнадцати'),
    16: ('шестнадцать', 'шестнадцати'), 17: ('семнадцать', 'семнадцати'),
    18: ('восемнадцать', 'восемнадцати'), 19: ('девятнадцать', 'девятнадцати'),
    20: ('двадцать', 'двадцати'), 21: ('двадцать одна', 'двадцати одной'),
    22: ('двадцать две', 'двадцати двух'), 23: ('двадцать три', 'двадцати трех'),
    24: ('двадцать четыре', 'двадцати четырех'), 25: ('двадцать пять', 'двадцати пяти'),
    26: ('двадцать шесть', 'двадцати шести'), 27: ('двадцать семь', 'двадцати семи'),
    28: ('двадцать восемь', 'двадцати восьми'), 29: ('двадцать девять', 'девяти'),
    31: ('тридцать одна', ''), 32: ('тридцать две', ''), 33: ('тридцать три', ''),
    34: ('тридцать четыре', ''), 35: ('тридцать пять', ''), 36: ('тридцать шесть', ''),
    37: ('тридцать семь', ''), 38: ('тридцать восемь', ''), 39: ('тридцать девять', ''),
    40: ('сорок', ''), 41: ('сорок одна', ''), 42: ('сорок две', ''), 43: ('сорок три', ''),
    44: ('сорок четыре', '')
}

dict_hour = {
    0: ('полночь', 'двенадцатого'), 1: ('час', 'первого'), 2: ('два', 'второго'), 3: ('три', 'третьего'),
    4: ('четыре', 'четвертого'), 5: ('пять', 'пятого'), 6: ('шесть', 'шестого'),
    7: ('семь', 'седьмого'), 8: ('восемь', 'восьмого'), 9: ('девять', 'девятого'),
    10: ('десять', 'десятого'), 11: ('одиннадцать', 'одиннадцатого'), 12: ('полдень', '')
}
