import os


def clear_screen():
    os.system('cls' if os.name == 'nt' else 'clear')


def print_header():
    print("================================================")
    print("   Программа Конвертация Времени. версия 1.0.0")
    print("================================================\n")


def print_max_attempts_message():
    """
    Отображает сообщение о превышении максимального количества попыток.
    """
    print("================================================")
    print("Превышено количество попыток. Выход из программы.")


def print_footer():
    print("================================================")
    print("   Спасибо за использование нашей программы!")
    print("================================================\n")


def print_separator():
    print("------------------------------------------------")


def print_formatted_time(formatted_time):
    print(f"{formatted_time}")
