#min = 0 ----------------------------------------------------------------------------------------------------------------------------------------------------

dict1 = {0:"двеннадцать", 1:"один", 2:"два",3:"три",4:"четыре",5:"пять",6:"шесть",7:"семь",8:"восемь",9:"девять",10:"десять",11:"одиннадцать",12:"двенадцать",13:"один",
14:"два",15:"три",16:"четыре",17:"пять",18:"шесть",19:"семь",20:"восемь",21:"девять",22:"десять",23:"одиннадцать",24:"двеннадцать"}


user_data = input("Enter your data in format hh:mm \n")

if user_data.count(":") != 1 or len(user_data) !=5:
    print("Please check your data and put it in correct format")
    exit()

hhmm = user_data.split(":")

hours = hhmm[0]
minutes = hhmm[1]

if len(hours) != 2 or len(minutes) != 2 or not hours.isdigit() or not minutes.isdigit():
    print("Please check your data and put it in correct format")
    exit()

hours = int(hours)
minutes = int(minutes)


if minutes == 0 and hours ==1 or hours ==13: 
    print(f"{dict1[hours]} час ровно")
elif minutes == 0 and hours >=2 and hours <=4: 
    print(f"{dict1[hours]} часа ровно")
elif minutes == 0 and hours >=5 and hours <=12: 
    print(f"{dict1[hours]} часов ровно")
elif minutes == 0 and hours >=14 and hours <=16: 
    print(f"{dict1[hours]} часа ровно")
elif minutes == 0 and hours >=17 and hours <=24: 
    print(f"{dict1[hours]} часов ровно")
elif minutes == 0 and hours ==0: 
    print(f"{dict1[hours]} часов ровно")


#min < 30 ----------------------------------------------------------------------------------------------------------------------------------------------------

dict2m = {1:"одна", 2:"две",3:"три",4:"четыре",5:"пять",6:"шесть",7:"семь",8:"восемь",9:"девять",10:"десять",11:"одиннадцать",12:"двенадцать",13:"триннадцать",
14:"четырнадцать",15:"пятнадцать",16:"шестнадцать",17:"семнадцать",18:"восемнадцать",19:"девятнадцать",20:"двадцать",21:"двадцать одна",22:"двадцать две",
23:"двадцать три",24:"двадцать четыре",25:"двадцать пять",26:"двадцать шесть",27:"двадцать семь",28:"двадцать восемь",29:"двадцать девять"}

dict2h ={1:"первого", 2:"второго",3:"третьего",4:"четвёртого",5:"пятого",6:"шестого",7:"седьмого",8:"восьмого",9:"девятого",10:"десятого",
11:"одиннадцатого",12:"двенадцатого",13:"первого",14:"второго",15:"третьего",16:"четвёртого",17:"пятого",18:"шестого",19:"седьмого",20:"восьмого",
21:"девятого",22:"десятого",23:"одиннадцатого",24:"двенадцатого"}

if minutes < 30 and (minutes ==1 or minutes == 21): 
    print(f"{dict2m[minutes]} минута {dict2h[hours+1]}")
elif minutes < 30 and minutes >=2 and minutes <= 4: 
    print(f"{dict2m[minutes]} минуты {dict2h[hours+1]}")
elif minutes < 30 and minutes >=22 and minutes <= 24: 
    print(f"{dict2m[minutes]} минуты {dict2h[hours+1]}")
elif minutes < 30 and minutes >=5 and minutes <= 20: 
    print(f"{dict2m[minutes]} минут {dict2h[hours+1]}")
elif minutes < 30 and minutes >=25 and minutes <= 29: 
    print(f"{dict2m[minutes]} минут {dict2h[hours+1]}")

#min == 30 --------------------------------------------------------------------------------------------------------------------------------------------------

if minutes == 30: 
    print(f"половина {dict2h[hours+1]}")

#min >30<45 -------------------------------------------------------------------------------------------------------------------------------------------------

dict3m = {31:"тридцать одна", 32:"тридцать две",33:"тридцать три",34:"тридцать четыре",35:"тридцать пять",36:"тридцать шесть",37:"тридцать семь",
38:"тридцать восемь",39:"тридцать девять",40:"сорок",41:"сорок одна",42:"сорок две", 43:"сорок три", 44:"сорок четыре"}


if minutes > 30 and minutes < 45 and (minutes ==31 or minutes ==41): 
    print(f"{dict3m[minutes]} минута {dict2h[hours+1]}")
elif minutes > 30 and minutes < 45 and (minutes >=32 and minutes <=34):
    print(f"{dict3m[minutes]} минуты {dict2h[hours+1]}")
elif minutes > 30 and minutes < 45 and (minutes >=35 and minutes <=40):
    print(f"{dict3m[minutes]} минут {dict2h[hours+1]}")
elif minutes > 30 and minutes < 45 and (minutes >=42 and minutes <=44):
    print(f"{dict3m[minutes]} минуты {dict2h[hours+1]}")

#min >=45 -------------------------------------------------------------------------------------------------------------------------------------------------

dict4h ={1:"час", 2:"два",3:"три",4:"четыре",5:"пять",6:"шесть",7:"семь",8:"восемь",9:"девять",10:"десять",11:"одиннадцать",12:"двенадцать",13:"час",
14:"два",15:"три",16:"четыре",17:"пять",18:"шесть",19:"семь",20:"восемь",21:"девять",22:"десять",23:"одиннадцать",24:"двеннадцать"}

dict4m ={1:"одной",2:"двух",3:"трёх",4:"четырёх",5:"пяти",6:"шести",7:"семи",8:"восьми",9:"девяти",10:"десяти",11:"одинадцати",12:"двенадцати",
13:"триннадцати",14:"четырнадцати",15:"пятнадцати"}

if minutes >= 45 and minutes < 59:
    print(f"без {dict4m[60-minutes]} минут {dict4h[hours+1]}")
elif minutes == 59:
    print(f"без {dict4m[60-minutes]} минуты {dict4h[hours+1]}")
