db = {1: (('один час', 'первого'), 'одна'), 2: (('два часа', 'второго'), 'две'),
      3: (('три часа', 'третьего'), 'три'), 4: (('четыре часа', 'четвёртого'), 'четыре'),
      5: (('пять часов', 'пятого'), 'пять'), 6: (('шесть часов', 'шестого'), 'шесть'),
      7: (('семь часов', 'седьмого'), 'семь'), 8: (('восемь часов', 'восьмого'), 'восемь'),
      9: (('девять часов', 'девятого'), 'девять'), 10: (('десять часов', 'десятого'), 'десять'),
      11: (('одинадцать часов', 'одинадцатого'), 'одинадцать'), 0: (('двенадцать часов', 'двенадцатого'), 'двенадцать'),
      12: (('двенадцать часов', 'двенадцатого'), 'двенадцать'),
      13: ('тринадцать',), 14: ('четырнадцать',), 15: ('пятнадцать',), 16: ('шестнадцать',), 17: ('семнадцать',),
      18: ('восемнадцать',), 19: ('девятнадцать',), 20: ('двадцать',), 30: ('тридцать',)}
db2 = {}
db_mm = {}


def enter():
    ent = input("Enter any time in format 'hh:mm': ")
    if len(ent) == 5 and ent[0:2].isdigit() and ent[-2:].isdigit() and 0 <= int(ent[0:2]) < 24 and 0 <= int(ent[-2:]) < 60:
        return (ent[0:2], ent[-2:])
    else:
        return enter()

all_lib = []
for hh in range(24):
    for mm in range(31):
        all_lib.append((str(hh).zfill(2), str(mm).zfill(2)))

while True:

    hh, mm = enter()
    ans_str = ''

    if mm == '00':
        hh = int(hh) % 12
        print(db[hh][0][0].capitalize(), 'ровно')

    elif mm == '30':
        hh = (int(hh)+1) % 12
        print('Половина ', db[hh][0][1])

    elif int(mm) < 30:
        if int(mm) >= 20:
            ans_str = ans_str + 'двадцать'
            if int(mm) != 20:
                ans_str = ans_str + ' ' + db[int(mm[-1])][-1]
        else:
            ans_str = ans_str + db[int(mm)][-1]
        if mm in ('01', '21'):
            ans_str = ans_str + ' минута'
        elif int(mm) in (2, 3, 4, 22, 23, 24):
            ans_str = ans_str + ' минуты'
        else:
            ans_str = ans_str + ' минут'

        hh = (int(hh) + 1) % 12
        ans_str = ans_str +' ' +  db[hh][0][-1]


