h = 22
if h > 12:
    h = h - 12
m = 32

minutes_tokens = ("минута", "минут", "минуты")
hours_tokens = ("часов", "часа")

values = {
    1: ("час", "первого", "одна", "одной"),
    2: ("два", "второго", "две", "двух"),
    3: ("три", "третьего", "три", "трёх"),
    12: ("двенадцать", "двенадцатого", "двенадцать", "двенадцати"),
    13: ("", "", "тринадцать", "тринадцати"),
    14: "",
    15: "",
    16: "",
    17: "",
    18: "",
    19: "",
    20: ("", "", "двадцать", "двадцати"),
    30: "",
    40: ""
}

